; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v11 ?v9)
             (pred_2 ?v12 ?v3)
             (pred_8 ?v11 ?v3)
             (pred_4 ?v4 ?v11 )
	     (pred_5 ?v11)
             (pred_3 ?v13)
             (pred_12 ?v12)
             (pred_10 ?v3)
             (pred_11 ?v11)
             (pred_1 ?v12)
             (pred_7 ?v11)
             (pred_9 ))



(:action op_5
:parameters (?v10 ?v2 ?v6 ?v1)
:precondition (and (pred_3 ?v10) (pred_3 ?v2) (pred_12 ?v6) (pred_10 ?v1)
          (pred_6 ?v10 ?v2) (pred_2 ?v6 ?v1)
                   (pred_8 ?v2 ?v1) (pred_5 ?v10) 
                   (pred_11 ?v2) (pred_1 ?v6))
:effect (and  (pred_7 ?v2) (not (pred_11 ?v2))))


(:action op_2
:parameters (?v10 ?v8)
:precondition (and (pred_3 ?v10) (pred_3 ?v8)
               (pred_5 ?v10) (pred_6 ?v10 ?v8) (pred_7 ?v8))
:effect (and (pred_5 ?v8) (not (pred_5 ?v10))))

(:action op_3
:parameters (?v10 ?v6)
:precondition (and (pred_3 ?v10) (pred_12 ?v6) 
                  (pred_5 ?v10) (pred_4 ?v6 ?v10) (pred_9 ))
:effect (and (pred_1 ?v6)
   (not (pred_4 ?v6 ?v10)) (not (pred_9 ))))


(:action op_4
:parameters (?v10 ?v5 ?v7)
:precondition (and (pred_3 ?v10) (pred_12 ?v5) (pred_12 ?v7)
                  (pred_5 ?v10) (pred_1 ?v7) (pred_4 ?v5 ?v10))
:effect (and (pred_1 ?v5) (pred_4 ?v7 ?v10)
        (not (pred_1 ?v7)) (not (pred_4 ?v5 ?v10))))

(:action op_1
:parameters (?v10 ?v6)
:precondition (and (pred_3 ?v10) (pred_12 ?v6) 
                  (pred_5 ?v10) (pred_1 ?v6))
:effect (and (pred_9 ) (pred_4 ?v6 ?v10) (not (pred_1 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_01 obj_16 obj_17 obj_20 obj_13 obj_07 obj_18 obj_19 obj_02 obj_09 obj_04 obj_12 obj_05 obj_15 obj_06
    obj_03 obj_14
    obj_10 obj_08
    )

    (:init
       (pred_9)

       (pred_3 obj_11)
       (pred_3 obj_01)
       (pred_3 obj_16)
       (pred_3 obj_17)
       (pred_3 obj_20)
       (pred_3 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_18)
       (pred_3 obj_19)
       (pred_3 obj_02)
       (pred_3 obj_09)
       (pred_3 obj_04)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_3 obj_15)
       (pred_3 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_08)

       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_16 obj_07)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_17 obj_16)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_13 obj_02)
       (pred_6 obj_13 obj_07)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_07 obj_16)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_02)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_02 obj_05)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_02 obj_13)
       (pred_6 obj_02 obj_19)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_09 obj_04)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_12 obj_05)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_05 obj_15)
       (pred_6 obj_05 obj_02)
       (pred_6 obj_05 obj_12)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_05)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_06 obj_15)
       (pred_11 obj_13)
       (pred_11 obj_01)
       (pred_8  obj_13 obj_03)
       (pred_8  obj_01 obj_14)
       (pred_7 obj_11)
       (pred_7 obj_16)
       (pred_7 obj_17)
       (pred_7 obj_20)
       (pred_7 obj_07)
       (pred_7 obj_18)
       (pred_7 obj_19)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_7 obj_04)
       (pred_7 obj_12)
       (pred_7 obj_05)
       (pred_7 obj_15)
       (pred_7 obj_06)

       (pred_2  obj_10 obj_03)
       (pred_2  obj_08 obj_14)
       (pred_4 obj_10 obj_18)
       (pred_4 obj_08 obj_11)
       (pred_5 obj_17)
    )

    (:goal (and
       (pred_4 obj_08 obj_02)
    ))
(:constraints
  (always (not (pred_5 obj_09)))
)
)

; plan
1. (op_2 obj_17 obj_18)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_18)
   goals met: 0 of 1
2. (op_3 obj_18 obj_10)
   deleted: (pred_4 obj_10 obj_18) (pred_9)
   added: (pred_1 obj_10)
   goals met: 0 of 1
3. (op_2 obj_18 obj_07)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_07)
   goals met: 0 of 1
4. (op_5 obj_07 obj_13 obj_10 obj_03)
   deleted: (pred_11 obj_13)
   added: (pred_7 obj_13)
   goals met: 0 of 1
5. (op_2 obj_07 obj_13)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_13)
   goals met: 0 of 1
6. (op_2 obj_13 obj_20)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_20)
   goals met: 0 of 1
7. (op_2 obj_20 obj_11)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_11)
   goals met: 0 of 1
8. (op_4 obj_11 obj_08 obj_10)
   deleted: (pred_1 obj_10) (pred_4 obj_08 obj_11)
   added: (pred_1 obj_08) (pred_4 obj_10 obj_11)
   goals met: 0 of 1
9. (op_2 obj_11 obj_20)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_20)
   goals met: 0 of 1
10. (op_2 obj_20 obj_13)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_13)
   goals met: 0 of 1
11. (op_2 obj_13 obj_02)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_02)
   goals met: 0 of 1
12. (op_1 obj_02 obj_08)
   deleted: (pred_1 obj_08)
   added: (pred_9) (pred_4 obj_08 obj_02)
   goals met: 1 of 1
